USE find_a_friend;

INSERT INTO place (country, region, city, district)
VALUES
    (N'Беларусь', N'Брестская область', N'Брест', N'Березовский'),
    (N'Беларусь', N'Брестская область', N'Брест', N'Ленинский'),
    (N'Беларусь', N'Минская область', N'Минск', N'Ленинский'),
    (N'Беларусь', N'Минская область', N'Минск', N'Центральный'),
    (N'Беларусь', N'Гродненская область', N'Гродно', N'Центральный');

INSERT INTO shelter (place_id, name, address, website)
VALUES
    (1, N'Приют для животных «Доброта»', N'Брест, ул. Писателя Смирнова, 161Ж', 'https://www.instagram.com/priutdobrota/'),
    (2, N'Приют "Эгида"', N'Минск, ул. Карла Маркса, 27', 'https://egida.by/'),
    (3, N'Приют "Суперкот"', N'Минск, ул. Гурского, 42', 'https://superkot.by/'),
    (4, N'ГООЗЖ "Преданное сердце"', N'Гродно, ул. Лапенковская, 7', 'https://predannoeserdce.by/');

INSERT INTO advert (advert_type, title, description, user_id, creation_date, place_id)
VALUES
    ('V', N'Предлагаю посильную помощь',
     N'Я Ваня и я отлично лажу с животными, в ближайший месяц свободен для любых предложений помочь в уходе за животными!', 1, '2023-04-06', 1),
    ('V', N'Помогу с любым котом!',
     N'Добрый вечер, я кото-психолог со стажем 25 лет, накормлю, умою, воспитаю любого кота!', 3, '2023-05-05', 3),
    ('S', N'Услуги ситтера в Минске',
     N'Отлично лажу с животными, особенно с котами, предлагаю себя и мою квартиру доя услуг ситтера в любой день в мае', 6, '2023-05-19', 3),
    ('S', N'Я - ситтер', N'Посижу с вашими кошками, собачками и другими животными за символическую плату', 6, '2023-05-14', 4);

INSERT INTO user_shelter
VALUES
       (4, 2),
       (5, 3);
--------------------------------------------------------------------------
INSERT INTO animal_type (name)
VALUES
    (N'Кот'),
    (N'Собака'),
    (N'Другое');

INSERT INTO role (name)
VALUES
    (N'Пользователь'),
    (N'Модератор'),
    (N'Администратор'),
    (N'Администратор приюта');
---------------------------------------------------------------------------
INSERT INTO animal_advert (animal_type_id, title, description, user_id, creation_date, place_id, birthday, sex, castrated)
VALUES
    (1, N'Кошка Соня', N'Кошка Соня ищет дом. Возраст 2 года. Окрас серый. Отдаем в добрые руки.', 1, '2023-05-08', 1, '2021-05-01', 'F', 'T'),
    (2, N'Собака Рекс', N'Собака Рекс ищет дом. Возраст 1 год. Окрас черно-белый. Отдаем в добрые руки.', 6, '2023-05-16', 2, '2022-03-08', 'M', 'T'),
    (1, N'Кошка Мурка', N'Кошка Мурка громко мурчит, её возраст 2 года. Она просто красавица! Любит детей', 5, '2023-05-23', 1, '2021-10-08', 'F', 'F'),
    (3, N'Лошадка-сладкоежка',
     N'Кобыла Алла два года побеждала в конкурсах до травмы хозяйки, она стала ненужной и очень ищет нового хозяина, именно вас!', 4, '2023-05-01', 4, '2020-11-11', 'F', 'F');

INSERT INTO [user] (name, surname, email, phone_number, login, password, role_id)
VALUES
    (N'Иван', N'Иванов', 'ivanov@mail.ru', '+375291234567', 'ivan@ivan', '@iva1_n', 1),
    (N'Петр', N'Петров', 'petrov@gail.ru', '+375293456789', 'petr123', '12345', 3),
    (N'Леонид', N'Лавринович', 'lavrik@mail.ru', '+375241232378', 'leolave', 'loveleo', 2),
    (N'Анна', N'Сувар', 'ann_pr@mail.ru', '+375231479421', 'ann_priut', '234567bvcx89', 4),
    (N'Геннадий', N'Жигало', 'jigga_priut@gmail.ru', '+375253792305', 'jigji', '12fr64_52tE', 4),
    (N'Сидор', N'Сидоров', 'sidorov@mail.ru', '+375295678901', 'alol_lola0990', 'atbcq469k^&mb', 1);
